import { typografRuleTest } from '../../../../test/helpers';

typografRuleTest(['ru/nbsp/mln', [
    [
        '10тыс. р\n5тыс руб',
        '10\u00a0тыс. р\n5\u00a0тыс руб'
    ],
    [
        'одна тыс. руб',
        'одна тыс. руб'
    ],
    [
        '22млн $',
        '22\u00a0млн $'
    ],
    [
        '22млнк',
        '22млнк'
    ],
    [
        '2млн',
        '2\u00a0млн'
    ],
    [
        '1тыс.',
        '1\u00a0тыс.'
    ],
    [
        '1тыс.\n2тыс.',
        '1\u00a0тыс.\n2\u00a0тыс.'
    ],
    [
        '1млрд евро',
        '1\u00a0млрд евро'
    ],
    [
        '3 трлн долларов',
        '3\u00a0трлн долларов'
    ],
    [
        '1000 тыс руб.\n1млн коп.\n1млрд\n1 трлн.',
        '1000\u00a0тыс руб.\n1\u00a0млн коп.\n1\u00a0млрд\n1\u00a0трлн.'
    ]
]]);
