tests.push(['ru/nbsp/twoPartAbbr', [
    ['т.д.',   'т.\u00A0д.'],
    ['т.п.',   'т.\u00A0п.'],
    ['т.е.',   'т.\u00A0е.'],
    ['т.к.',   'т.\u00A0к.'],
    ['т.н.',   'т.\u00A0н.'],
    ['т.о.',   'т.\u00A0о.'],
    ['т.с.',   'т.\u00A0с.'],
    ['ст.л.',  'ст.\u00A0л.'],
    ['ч.л.',   'ч.\u00A0л.'],
    ['н.ст.',  'н.\u00A0ст.'],
    ['ст.ст.', 'ст.\u00A0ст.'],
    ['н.э.',   'н.\u00A0э.'],
    ['ж.д.',   'ж.\u00A0д.'],
    ['с.х.',   'с.\u00A0х.'],
    ['ед.ч.',  'ед.\u00A0ч.'],
    ['мн.ч.',  'мн.\u00A0ч.'],
    ['Яндекс.Браузер v.1.0', 'Яндекс.Браузер v.1.0']
]]);
