QUnit.module('rules');

var tests = [
    ['copy', [
        ['(c)', '©'],
        ['(с)', '©'],
        ['(r)', '®'],
        ['+/-', '±'],
        ['(tm)', '™']
    ]],
    ['izza', [
        ['Из за лесу', 'Из-за лесу'],
        ['  Из за лесу', '  Из-за лесу'],
        ['из за гор', 'из-за гор'],
        ['  из за гор', '  из-за гор']
    ]],
    ['c', [
        [' 200 C', ' 200 °C'],
        [' 200 C.', ' 200 °C.'],
        [' 20d C', ' 20d C'],
        [' 20 C1', ' 20 C1'],
        [' 200 F', ' 200 °F']
    ]],
    ['replace_tab', [
        ['  \t \t \t  ', '         ']
    ]],
    ['cc', [
        ['20 в. в.', '20\u00A0вв.'],
        ['1934 в. в.', '1934\u00A0вв.'],
        ['1934в.в.', '1934\u00A0вв.'],
        ['1934в. в.', '1934\u00A0вв.'],
        ['1934 в.в.', '1934\u00A0вв.']
    ]],
    ['hellip', [
        ['Текст текст... Другой текст... ', 'Текст текст… Другой текст… '],
        ['..', '..'],
        ['...', '…'],
        ['.....', '.....']
    ]],
    ['to', [
        ['Подобру то поздорову.', 'Подобру-то поздорову.'],
        ['когда то', 'когда-то'],
        ['Какой либо', 'Какой-либо'],
        ['откуда либо', 'откуда-либо'],
        ['Кто нибудь', 'Кто-нибудь'],
        ['ну кась', 'ну-кась']
    ]],
    ['taki', [
        ['верно таки', 'верно-таки'],
        ['довольно таки', 'довольно-таки'],
        ['опять таки', 'опять-таки'],
        ['прямо таки', 'прямо-таки'],
        ['так таки', 'так-таки'],
        ['всё таки', 'всё-таки'],
        ['действительно таки', 'действительно-таки'],
        ['неужели таки', 'неужели-таки']
    ]],
    ['izza', [
        [' из за печки', ' из-за печки'],
        [' Из за печки', ' Из-за печки']
    ]],
    ['izpod', [
        [' из под печки', ' из-под печки'],
        [' Из под печки', ' Из-под печки']
    ]],
    ['koe', [
        ['Завелись кое какие деньжонки.', 'Завелись кое-какие деньжонки.'],
        ['Кое какие деньжонки.', 'Кое-какие деньжонки.'],
        ['Кое как', 'Кое-как'],
        ['Кой как', 'Кой-как'],
        ['кой с каким', 'кой с каким'],
        ['Кое в чем', 'Кое в чем'],
        ['Кой какой', 'Кой-какой']
    ]]

];

QUnit.module('rules');

tests.forEach(function(elem) {
    test(elem[0], function() {
        elem[1].forEach(function (as) {
            equal(rule(elem[0], as[0]), as[1]);
        });
    });
});
