tests.push(['common/punctuation/apostrophe', [
    [
        'Жанна д\'Арк, О\'Коннор, д\'Артаньян',
        'Жанна д’Арк, О’Коннор, д’Артаньян',
        'ru'
    ],
    [
        'c-moll\'ная увертюра, пользоваться E-mail\'ом',
        'c-moll’ная увертюра, пользоваться E-mail’ом',
        'ru'
    ],
    [
        'Кот-д\'Ивуар',
        'Кот-д’Ивуар',
        'ru'
    ],
    [
        'Л\'Алькерия-д\'Аснар',
        'Л’Алькерия-д’Аснар',
        'ru'
    ],
    [
        'Не говорите плохо о Yoko, хотя бы из-за уважения к Lennon\'у',
        'Не говорите плохо о Yoko, хотя бы из-за уважения к Lennon’у',
        'ru'
    ],
    [
        'О\'Коннор, О\'Хара, О\'Нил, О\'Хиггинс, О\'Куинн, О\'Кейси',
        'О’Коннор, О’Хара, О’Нил, О’Хиггинс, О’Куинн, О’Кейси',
        'ru'
    ],
    [
        'Кот-д\'Ор, Кот-д\'Армор, Л\'Умо, Пон-л\'Эвек, Л\'Иль-сюр-ла-Сорг,  Морро-д\'Оро, Морро-д\'Альба, Л\'Алькерия-д\'Аснар',
        'Кот-д’Ор, Кот-д’Армор, Л’Умо, Пон-л’Эвек, Л’Иль-сюр-ла-Сорг,  Морро-д’Оро, Морро-д’Альба, Л’Алькерия-д’Аснар',
        'ru'
    ],
    [
        'Yesterday I saw Jack\'s dog',
        'Yesterday I saw Jack’s dog',
        'en'
    ],
    [
        'tables\' legs',
        'tables\' legs',
        'en'
    ],
    [
        'Katie\'s and Erin\'s houses are beautiful.',
        'Katie’s and Erin’s houses are beautiful.',
        'en'
    ]
]]);
