/*jshint maxlen:1000 */
tests.push(['ru/punctuation/ano', [
    [
        'Его лодка скользнула вниз но бедняга держался по-прежнему стойко.',
        'Его лодка скользнула вниз, но бедняга держался по-прежнему стойко.'
    ],
    [
        'Я пошёл домой а он остался.',
        'Я пошёл домой, а он остался.'
    ],
    [
        '- Начну делать это сейчас, - сказал он, - а когда ты вернёшься, мы продолжим вместе.',
        '- Начну делать это сейчас, - сказал он, - а когда ты вернёшься, мы продолжим вместе.'
    ]
]]);
