tests.push(['ru/punctuation/apostrophe', [
    [
        'Жанна д\'Арк, О\'Коннор, д\'Артаньян',
        'Жанна дʼАрк, ОʼКоннор, дʼАртаньян'
    ],
    [
        'c-moll\'ная увертюра, пользоваться E-mail\'ом',
        'c-mollʼная увертюра, пользоваться E-mailʼом'
    ],
    [
        'Кот-д\'Ивуар',
        'Кот-дʼИвуар'
    ],
    [
        'Л\'Алькерия-д\'Аснар',
        'ЛʼАлькерия-дʼАснар',
    ],
    [
        'Не говорите плохо о Yoko, хотя бы из-за уважения к Lennon\'у',
        'Не говорите плохо о Yoko, хотя бы из-за уважения к Lennonʼу'
    ],
    [
        'О\'Коннор, О\'Хара, О\'Нил, О\'Хиггинс, О\'Куинн, О\'Кейси',
        'ОʼКоннор, ОʼХара, ОʼНил, ОʼХиггинс, ОʼКуинн, ОʼКейси'
    ],
    [
        'Кот-д\'Ор, Кот-д\'Армор, Л\'Умо, Пон-л\'Эвек, Л\'Иль-сюр-ла-Сорг,  Морро-д\'Оро, Морро-д\'Альба, Л\'Алькерия-д\'Аснар',
        'Кот-дʼОр, Кот-дʼАрмор, ЛʼУмо, Пон-лʼЭвек, ЛʼИль-сюр-ла-Сорг,  Морро-дʼОро, Морро-дʼАльба, ЛʼАлькерия-дʼАснар'
    ]
]]);
