/*jshint maxlen:1000 */
tests.push(['ru/punctuation/hellip', [
    [
        'Дубровский молчал... Вдруг он поднял голову, глаза его засверкали, он топнул ногою, оттолкнул секретаря...',
        'Дубровский молчал… Вдруг он поднял голову, глаза его засверкали, он топнул ногою, оттолкнул секретаря…'
    ],
    [
        'Простите, государь!… Стоять я не могу...',
        'Простите, государь!.. Стоять я не могу…'
    ],
    [
        'Не правда ль, ты одна?... Ты плачешь? Я спокоен... Но если... (Пушкин).',
        'Не правда ль, ты одна?.. Ты плачешь? Я спокоен… Но если… (Пушкин).'
    ],
    [
        'Сколько жить еще на свете?… (Твардовский); А как вы вчера играли!… (А.Н. Островский).',
        'Сколько жить еще на свете?.. (Твардовский); А как вы вчера играли!.. (А.Н. Островский).'
    ],
    [
        'Моя работа…, но, впрочем, не будем говорить о ней.',
        'Моя работа… но, впрочем, не будем говорить о ней.'
    ],
    [
        '...Ва... ва... ва... ваше превосходительство, — шептал Попов (А. К. Толстой).',
        '…Ва… ва… ва… ваше превосходительство, — шептал Попов (А. К. Толстой).'
    ],
    [
        'Маркс писал, что «язык... есть практическое, существующее и для других людей и лишь тем самым существующее также и для меня самого, действительное сознание».',
        'Маркс писал, что «язык… есть практическое, существующее и для других людей и лишь тем самым существующее также и для меня самого, действительное сознание».'
    ],
    ['..', '..'],
    ['...', '…'],
    ['.....', '.....']
]]);
